/**
 * @file errorText.js
 * @author shijh
 *
 * 错误信息
 */
const ERRORTEXT = {
    20: '当前页显示记录数',
    // 200: '请求成功',
    // 500: '服务器错误',
    // 5001: '服务器异常',
    400: '请求参数有误',
    401: '用户未登录',
    402: '业务逻辑错误响应码',
    403: '业务逻辑错误响应码',
    10000: '用户已存在',
    10001: '序号重复',
    504: '网关超时',
    10003: '上传失败，上传图片数据为空',
    10004: '上传失败，数据不合法',
    10005: '上传图片格式不合法',
    10006: '记录不存在',
    10007: '公司名称重复',
    10008: '供应商编号重复',
    10009: '供应商注册号重复',
    10010: '供应商主账号重复',
    10011: '纳税人识别码重复',
    10012: '银行账号重复',
    10013: '营业执照号重复',
    10014: '组织机构代码重复',
    10015: '紧急联系人联系电话重复',
    10016: '紧急联系人公司电话重复',
    10017: '入驻联系人电话重复',
    10018: '入驻联系人邮箱重复',
    10019: '正常状态的供应商已存在',
    10020: '数据没有被更新',
    10021: '主键没有传递,更新失败',
    10022: '后台运行异常检查传入审核参数是否符合规范',
    10023: '该商品在该子公司已有配置销售信息',
    10024: '更新失败',
    10025: '插入失败',
    10026: '删除操作失败',
    10027: '没有可处理的商品id',
    10028: '采购内装数必须是默认箱规的整数倍',
    10029: '商品的默认箱规的为零',
    10030: '流水号生成失败',
    10031: '订单校验失败',
    10032: '供应商地址已发生改变',
    10034: '条形码的URL插入失败',
    20001: '提示错误',
}

export default ERRORTEXT;
